ysuolmai/conduit-stream/framework/sdkconfig.defaults
# Conduit Stream - ESP-IDF default config for the ESP32-S3 N16R8.
# PlatformIO/idf.py apply these on a clean build. Edit via `pio run -t menuconfig`
# (or `idf.py menuconfig`) if you need to change them later.

CONFIG_IDF_TARGET="esp32s3"

# ALAC + AES decoding and RTP servicing need deterministic headroom.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FREERTOS_HZ=1000

# Six queued UDP datagrams is only about 48 ms of 352-frame RAOP packets. Allow
# short Wi-Fi bursts to queue instead of dropping packets before the RTP task runs.
CONFIG_LWIP_UDP_RECVMBOX_SIZE=32

# Give the Wi-Fi driver room for aggregate/bursty RX without starving internal RAM.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_RX_BA_WIN=16

# --- 16 MB flash, QIO @ 80 MHz ---
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# --- 8 MB OCTAL PSRAM @ 80 MHz (this is the "R8" half of N16R8) ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# --- Partition table ---
# Managed by PlatformIO via `board_build.partitions = partitions.csv`, which sets
# CONFIG_PARTITION_TABLE_CUSTOM for us. Don't hard-code the filename here too.

# --- Console: route logging to the built-in USB Serial/JTAG so the boot banner
#     and logs appear on the USB-C port of this native-USB S3 (UART0 pins aren't
#     wired to anything). Set via Kconfig here, NOT as a -D build flag. ---
CONFIG_ESP_CONSOLE_UART_DEFAULT=n
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
